app/Controllers/User.php

SELECT *
FROM `countries`
SELECT *
FROM `roles`
WHERE `name` = 'user'
 LIMIT 1
---
    public function index()
    {
        $countryModel  = model(CountryModel::class);
        $roleModel = model(RoleModel::class);

        $data['title'] = "Sign Up";
        $data['countries'] = $countryModel->findAll();
        $data['role'] = $roleModel->where('name', 'user')->first();

INSERT INTO `users` (`email`, `first_name`, `last_name`, `role_id`, `password`, `phone_number`) VALUES ('cristopheralvarado101@gmail.com', 'Alvarado', 'cristopheralvarado101@gmail.com', '2', '12345678', '+50683744833')
INSERT INTO `addresses` (`user_id`, `address1`, `address2`, `country_id`, `city`, `postal_code`) VALUES (36, 'Fortuna', 'Los Angeles', '1', 'Cuidad Quesada', '20072')
---
    public function store($roleId)
    {
        $userModel    = model(UserModel::class);
        $addressModel = model(AddressModel::class);

        $userData = [
            'email'        => $this->request->getVar('email'),
            'first_name'   => $this->request->getVar('lastName'),
            'last_name'    => $this->request->getVar('email'),
            'role_id'      => $roleId,
            'password'     => $this->request->getVar('password'),
            'phone_number' => $this->request->getVar('phone')
        ];

        $userId = $userModel->insert($userData);

        if ($userId) {
            $addressData = [
                'user_id'     => $userId,
                'address1'    => $this->request->getVar('address1'),
                'address2'    => $this->request->getVar('address2'),
                'country_id'  => $this->request->getVar('countryId'),
                'city'        => $this->request->getVar('city'),
                'postal_code' => $this->request->getVar('postalCode')
            ];

            $addressModel->insert($addressData);